# Combining DataFrames

## Outline
* Why combine DataFrames?
* The union
* The join

## Why combine DataFrames?
It is often useful to combine more than one DataFrame together in different ways to create a larger DataFrame.

In [1]:
import pandas as pd

In [2]:
# Let us first define some example tables
df_first_names_1 = pd.DataFrame({'STUDENT_ID':['S1234','S4321'],
                                 'FIRST_NAME':['Daniel', 'Alfredo']})
df_first_names_2 = pd.DataFrame({'STUDENT_ID':['S3333','S4444'],
                                  'FIRST_NAME':['Gertrude', 'Ying']})

df_last_names = pd.DataFrame({'STUDENT_ID':['S4321','S3333','S4444','S5678'],
                                  'LAST_NAME':['Smith', 'Guptda', 'Minard', 'Gonzales']})

In [3]:
df_first_names_1

  STUDENT_ID FIRST_NAME
0      S1234     Daniel
1      S4321    Alfredo

In [4]:
df_first_names_2

  STUDENT_ID FIRST_NAME
0      S3333   Gertrude
1      S4444       Ying

In [5]:
df_last_names

  STUDENT_ID LAST_NAME
0      S4321     Smith
1      S3333    Guptda
2      S4444    Minard
3      S5678  Gonzales

### The Union


Let's combine these two dataframes by concatenating the columns of both into one dataframe. We do this with `pd.concat()`, which accepts a list-like collection of dataframes.  Specify `axis='columns'` to concatenate along the columns axis.

In [6]:
df_first_names = pd.concat([df_first_names_1, df_first_names_2]).reset_index(drop = True)

df_first_names

  STUDENT_ID FIRST_NAME
0      S1234     Daniel
1      S4321    Alfredo
2      S3333   Gertrude
3      S4444       Ying

### Merging dataframe

When you use `merge()`, you’ll provide two required arguments:

- The left DataFrame
- The right DataFrame

After that, you can provide a number of optional arguments to define how your datasets are merged, the most popular are:

- how: This defines what kind of merge to make. It defaults to `inner`, but other possible options include `outer`, `left`, and `right`.

- on: Use this to tell `merge()` which columns or indices (also called key columns or key indices) you want to join on. This is optional.


### The Inner Join

In an inner join, you will lose rows that don’t have a match in the other dataframe’s key column.

Left Side |  | Right Side
:-------------------------:|:-------------------------:|:--------------------:
<img src="https://imgur.com/bKOhL4h.jpg" alt="LEFT"> |   |  <img src="https://imgur.com/zp9JmWL.jpg"  alt='RIGHT'>
| Inner Merged | 
| <img src="https://imgur.com/juL2H0R.jpg" alt="Right Merge"> |

In [7]:
df_first_names

  STUDENT_ID FIRST_NAME
0      S1234     Daniel
1      S4321    Alfredo
2      S3333   Gertrude
3      S4444       Ying

In [8]:
df_last_names

  STUDENT_ID LAST_NAME
0      S4321     Smith
1      S3333    Guptda
2      S4444    Minard
3      S5678  Gonzales

In [9]:
pd.merge(df_first_names, df_last_names, on = "STUDENT_ID", how = "inner")

  STUDENT_ID FIRST_NAME LAST_NAME
0      S4321    Alfredo     Smith
1      S3333   Gertrude    Guptda
2      S4444       Ying    Minard

### The outer Join

This type of join is invoked by passing how=`outer` as an argument. This join type returns all of the pairwise combinations of rows from both DataFrames; i.e., the resulting dataframe will contain `NaN` where data is missing in one of the dataframes.

Left Side |  | Right Side
:-------------------------:|:-------------------------:|:--------------------:
<img src="https://imgur.com/bKOhL4h.jpg" alt="LEFT"> |   |  <img src="https://imgur.com/zp9JmWL.jpg"  alt='RIGHT'>
|   Outer Merged |   
| <img src="https://imgur.com/NZqgFf1.jpg" alt="Right Merge"> |

In [10]:
pd.merge(df_first_names, df_last_names, on = "STUDENT_ID", how = "outer")

  STUDENT_ID FIRST_NAME LAST_NAME
0      S1234     Daniel       NaN
1      S4321    Alfredo     Smith
2      S3333   Gertrude    Guptda
3      S4444       Ying    Minard
4      S5678        NaN  Gonzales

### The left Join

Like an inner join, a left join uses join keys to combine two DataFrames. A left join will return all of the rows from the left DataFrame, even those rows whose join key(s) do not have values in the right DataFrame. Rows in the left DataFrame that are missing values for the join key(s) in the right DataFrame will simply have null (i.e., NaN or None) values for those columns in the resulting joined DataFrame.

Note: a left join will still discard rows from the right DataFrame that do not have values for the join key(s) in the left DataFrame.


Left Side |  | Right Side
:-------------------------:|:-------------------------:|:--------------------:
<img src="https://imgur.com/bKOhL4h.jpg" alt="LEFT"> |   |  <img src="https://imgur.com/zp9JmWL.jpg"  alt='RIGHT'>
| Left Merged | 
| <img src="https://imgur.com/hGg40Po.jpg" alt="left join"> |

In [11]:
pd.merge(df_first_names, df_last_names, on = "STUDENT_ID", how = "left")

  STUDENT_ID FIRST_NAME LAST_NAME
0      S1234     Daniel       NaN
1      S4321    Alfredo     Smith
2      S3333   Gertrude    Guptda
3      S4444       Ying    Minard

### The right Join

The right join is invoked by passing how=`right` as an argument. It is similar to a left join, except all rows from the right DataFrame are kept, while rows from the left DataFrame without matching join key(s) values are discarded.

Left Side |  | Right Side
:-------------------------:|:-------------------------:|:--------------------:
<img src="https://imgur.com/bKOhL4h.jpg" alt="LEFT"> |   |  <img src="https://imgur.com/zp9JmWL.jpg"  alt='RIGHT'>
| Right Merged | 
| <img src="https://imgur.com/GDfbxmT.jpg" alt="Right Merge"> |

In [12]:
pd.merge(df_first_names, df_last_names, on = "STUDENT_ID", how = "right")

  STUDENT_ID FIRST_NAME LAST_NAME
0      S4321    Alfredo     Smith
1      S3333   Gertrude    Guptda
2      S4444       Ying    Minard
3      S5678        NaN  Gonzales

### Summary

- You can concatenate two dataframes across rows or columns by using the function `concat()`
- You can use `merge()` to combine data on common columns or indices
     - Inner join
     - Outer join
     - Left join
     - Right join